ЛИС2/src/Catalogs/ТипыГПА/ТипыГПА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыГПА</name>
  <attributes>
    <name>ТипТурбины</name>
    <type>
      <types>EnumRef.ТипыТурбинГПА</types>
    </type>
  </attributes>
  <attributes>
    <name>МощностьГПА</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭффективныйКПДВСтанционныхУсловиях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческаяПроизводительностьНагнетателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаВращенияРотораНаНоминальномРежиме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АбсолютноеДавлениеЗаОсевымКомпрессоромГТУНаНоминальномРежиме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоминальныйРасходТопливногоГаза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоминальныйРасходЦикловогоВоздуха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоминальныйРасходПродуктовСгоранияНаСрезеВыхлопногоПатрубкаТурбины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоминальныйУдельныйВыбросНаЕдТопливногоГазаОксидовАзота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоминальныйУдельныйВыбросНаЕдТопливногоГазаОксидаУглерода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВыбросовГазаПриПускеГПА</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапускаГПА</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВыбросовПриОстановке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезвозвратныеПотериМасла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕмкостьМаслосистемы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриведеннаяКонцентрацияОксидовАзота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриведеннаяКонцентрацияОксидаУглерода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиПоСезонности</name>
    <attributes>
      <name>Сезонность</name>
      <type>
        <types>EnumRef.Сезонность</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТурбины</name>
      <type>
        <types>EnumRef.ТипыТурбинГПА</types>
      </type>
    </attributes>
    <attributes>
      <name>МощностьГПА</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныйКПДВСтанционныхУсловиях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоммерческаяПроизводительностьНагнетателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧастотаВращенияРотораНаНоминальномРежиме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АбсолютноеДавлениеЗаОсевымКомпрессоромГТУНаНоминальномРежиме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоминальныйРасходТопливногоГаза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоминальныйРасходЦикловогоВоздуха</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоминальныйРасходПродуктовСгоранияНаСрезеВыхлопногоПатрубкаТурбины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоминальныйУдельныйВыбросНаЕдТопливногоГазаОксидовАзота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоминальныйУдельныйВыбросНаЕдТопливногоГазаОксидаУглерода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемВыбросовГазаПриПускеГПА</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗапускаГПА</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемВыбросовПриОстановке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БезвозвратныеПотериМасла</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕмкостьМаслосистемы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриведеннаяКонцентрацияОксидовАзота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриведеннаяКонцентрацияОксидаУглерода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Enums/Сезонность/Сезонность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Сезонность</name>
  <enumValues>
    <name>Зима</name>
  </enumValues>
  <enumValues>
    <name>Лето</name>
  </enumValues>
  <enumValues>
    <name>ВесьГод</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Catalogs/ТипыГПА/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем ТекСостояниеСезонности;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//для новых элементов создаем 3 строки в ТЧ ПоказателиПоСезонности: 0 - ВесьГод, 1-Зима, 2-Лето
	Если Объект.ПоказателиПоСезонности.Количество() = 0 Тогда
		НовСтр = Объект.ПоказателиПоСезонности.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Объект);
		НовСтр.Сезонность = Перечисления.Сезонность.ВесьГод;
		
		НовСтр = Объект.ПоказателиПоСезонности.Добавить();
		НовСтр.Сезонность = Перечисления.Сезонность.Зима;
		
		НовСтр = Объект.ПоказателиПоСезонности.Добавить();
		НовСтр.Сезонность = Перечисления.Сезонность.Лето;
	КонецЕсли;
	
	//устанавливаем тумблер в положение "весь год"
	ЗаполнитьЗначенияСвойств(Объект,Объект.ПоказателиПоСезонности[0]);									 
	
КонецПроцедуры


&НаКлиенте
Процедура УдельныеПоказателиВыбросовЗагрязняющихВеществНажатие(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 		
		Если Не Записать() Тогда 
			Возврат
		КонецЕсли;			
	КонецЕсли;	
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипГПА", Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.УдельныеПоказателиВыбросовЗагрязняющихВеществГПА.ФормаСписка", ПараметрыФормы, ЭтаФорма, Новый УникальныйИдентификатор);
	
КонецПроцедуры // Процедура УдельныеПоказателиВыбросовЗагрязняющихВеществНажатие(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

&НаКлиенте
Процедура лп_СезонностьПриИзменении(Элемент)
	
	//заполним из реквизитов в ТЧ, показатели по сезоности в зависимости от переключателя
	ЗаполнитьЗначенияСвойств(Объект.ПоказателиПоСезонности[ТекСостояниеСезонности],Объект);
	ТекСостояниеСезонности = лп_Сезонность;
	//заполним из ТЧ в реквизиты, показатели по сезоности в зависимости от переключателя
	ЗаполнитьЗначенияСвойств(Объект,Объект.ПоказателиПоСезонности[ТекСостояниеСезонности]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьЗначенияСвойств(Объект.ПоказателиПоСезонности[ТекСостояниеСезонности],Объект);
КонецПроцедуры

ТекСостояниеСезонности = 0;
